app/controllers/movies_controller.rb

  def find_movie_by_director
    @movie = Movie.find params[:id]
    movie_director = @movie.director
    if (movie_director.nil? || (movie_director == ""))
      flash[:notice] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies = Movie.where(director: movie_director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]